Repository: GIS4DEV/DataPlotly
Catalog: help/locale/*/LC_MESSAGES/processing_provider.po
Languages: nl

source: DataPlotly as Processing provider
nl: DataPlotly als Processing provider

source: From version 1.4 DataPlotly has been added as Processing provider thank to the work of `Michaël Douchin of 3Liz <https://www.3liz.com/>`_.
nl: Vanaf versie 1.4 is DataPlotly toegevoegd als Processing Provider dankzij het werk van `Michaël Douchin van 3Liz <https://www.3liz.com/>`_.

source: This opens the doors to infinite possibilities:
nl: Dit opent deuren tot oneindige mogelijkheden:

source: using all the Processing methods with DataPlotly
nl: gebruik maken van alle Processing methoden met DataPlotly

source: creating batch plots with one click
nl: diagrammen in batch produceren met één klik

source: adding DataPlotly in the Processing Graphical Modeler
nl: DataPlotly toevoegen aan Grafische modellen

source: Activating DataPlotly for Processing
nl: DataPlotly activeren voor Processing

source: First thing to do is activating Processing and add DataPlotly as provider. If not added by default you can go in ``Settings -> Options`` and click on the last tab named Processing.
nl: Als eerste moet DataPlotly toegevoegd zijn als Processing Provider. Als dit niet automatisch het geval is, kun je naar Instellingen -> opties gaan en daar naar het laatste tabblad genaamd Processing gaan.

source: Expand the Provider menu and activate the DataPlotly provider:
nl: Klap het Provider menu uit en activeer de DataPlotly provider:

source: And then you will see the DataPltoly provider in the Processing Toolbox:
nl: Nu zul je de DataPlotly provider in de Processing Toolbox zien:

source: Simple DataPlotly usage
nl: Eenvoudig DataPlotly gebruik

source: The ``Build a generic plot`` algorithm is a simplified version of DataPlotly plugin: this means you don't have all the customizations available, but still you can create awesome plots.
nl: Het ``Bouw een generiek diagram`` algoritme is een gesimplificeerde versie van de DataPlotly plugin: dit betekent dat je niet alle aanpassingen voor handen hebt, maar nog steeds geweldige diagrammen kunt maken.

source: The interface is very simple and the plot creation process is very straightforward:
nl: De interface is erg simpel en het diagram creatieproces is erg eenvoudig:

source: choose the layer
nl: Kies de laag

source: choose the plot type
nl: Kies het diagramtype

source: adjust the additional options (plot title, X axis, Y axis and color)
nl: Pas de additionele opties aan (titel, X as, Y as en kleur)

source: DataPlotly will create 2 results:
nl: DataPloty zal 2 resultaten aanmaken:

source: ``html`` file with the final plot
nl: ``html`` bestand met het definitieve diagram

source: ``json`` file with all the plot specifications
nl: ``json`` bestand met de diagramspecificaties

source: The plot can be opened in the ``Processing -> Result Viewer``:
nl: Het diagram kan worden geopend via ``Processing -> Result Viewer``:

source: And by simple double clicking on the menu entry, the plot will be opened in your default browser:
nl: Door dubbel te klikken op het item in het menu, zal het diagram worden geopend in uw standaard browser:

source: If you want to save also the ``json`` file, you have to specify the path in the DataPlotly Processing Window.
nl: Als je ook het ``json`` bestand op wilt slaan, moet je de locatie specificeren in het DataPlotly Processing venster
